In [1]:
import sys
sys.path.append('/home/samer/projects/fuzzy_sql/src') #This will enable reading the modules
from pathlib import Path
import os
import json
import time

from fuzzy_sql.rnd_query import RND_QUERY
from fuzzy_sql.fuzzy_sql import *

In [2]:
def gen_aggfltr_queries(query_obj: object,syn_tbl_name_lst: str) -> list:
    n_queries=10
    queries = []
    timeout=0.01 #maximum time in secs to execute the query, otherwise it will be skipped to next random query 
    for k in range(n_queries):
        query_obj.no_groupby_vars=2
        query_obj.no_where_vars=3
        start_time=time.time()
        while time.time() < start_time+timeout:
            rnd_query=query_obj.make_twin_aggfltr_query(syn_tbl_name_lst)
            matched_query=query_obj._match_twin_query(rnd_query)
            scored_query=query_obj.calc_dist_scores(matched_query)
            queries.append(scored_query)
            print('Generated Random Aggregate Filter Query - {} '.format(str(k)))
            break  
    return queries

In [3]:
#set directories
root_dir=Path('/home/samer/projects/fuzzy_sql')
metadata_dir=os.path.join(root_dir,'data/sdgd/processed/metadata')
db_path=os.path.join(root_dir,'db/sdgd.db')

In [4]:
#define input tables and metadata

tbl_names_lst=["C1"]
syn_tbl_name_lst=['C1_syn_default_1']

metadata_lst=[]
for tbl_name in tbl_names_lst:
    with open(os.path.join(metadata_dir,tbl_name+'.json'),'r') as f:
        metadata_lst.append(json.load(f))

#connect to db
conn = sqlite3.connect(db_path)

In [5]:
query_obj=RND_QUERY(conn, tbl_names_lst, metadata_lst)

Metadata for table C1 is valid.
Parameter input is valid.

In [6]:
gen_aggfltr_queries(query_obj,syn_tbl_name_lst)

Generated Random Aggregate Filter Query - 0
Generated Random Aggregate Filter Query - 1
Generated Random Aggregate Filter Query - 2
Generated Random Aggregate Filter Query - 3
Generated Random Aggregate Filter Query - 4
Generated Random Aggregate Filter Query - 5
Generated Random Aggregate Filter Query - 6
Generated Random Aggregate Filter Query - 7
Generated Random Aggregate Filter Query - 8
Generated Random Aggregate Filter Query - 9

[{'query_real': Empty DataFrame
  Columns: [race, workclass, COUNT(*), AVG(hours_per_week)]
  Index: [],
  'query_syn': Empty DataFrame
  Columns: [race, workclass, COUNT(*), AVG(hours_per_week)]
  Index: [],
  'query_desc': {'type': 'twin_agg',
   'agg_fntn': ('AVG', 'hours_per_week'),
   'grpby_vars': ['race', 'workclass'],
   'from_tbl_name_real': 'C1',
   'join_tbl_name_lst_real': [],
   'sql_real': "SELECT race, workclass, COUNT(*), AVG(hours_per_week)  FROM C1  WHERE  NOT  sex IN ('Male', 'Female') AND  marital_status = 'Married-civ-spouse' AND  fnlwgt BETWEEN 126946 AND 225065  GROUP BY race, workclass",
   'n_cols_real': 4,
   'n_rows_real': 0,
   'from_tbl_name_syn': 'C1_syn_default_1',
   'join_tbl_name_lst_syn': [],
   'sql_syn': "SELECT race, workclass, COUNT(*), AVG(hours_per_week)  FROM C1_syn_default_1  WHERE  NOT  sex IN ('Male', 'Female') AND  marital_status = 'Married-civ-spouse' AND  fnlwgt BETWEEN 126946 AND 225065  GROUP BY race, workclass",
   'n_cols_syn': 4,
   'n_rows_syn': 0},
  'query_hlngr_score': nan,
  'query_ecldn_score': nan},
 {'query_real':                   race         workclass  COUNT(*)    AVG(fnlwgt)
  0   Amer-Indian-Eskimo                 ?        35   84010.057143
  1   Amer-Indian-Eskimo       Federal-gov        33   97679.212121
  2   Amer-Indian-Eskimo         Local-gov        65  101126.169231
  3   Amer-Indian-Eskimo           Private       278  128442.050360
  4   Amer-Indian-Eskimo      Self-emp-inc         2  171968.500000
  5   Amer-Indian-Eskimo  Self-emp-not-inc        34  143936.264706
  6   Amer-Indian-Eskimo         State-gov        23  120458.086957
  7   Asian-Pac-Islander                 ?        17  158086.588235
  8   Asian-Pac-Islander       Federal-gov        15   98935.666667
  9   Asian-Pac-Islander         Local-gov        14  156606.000000
  10  Asian-Pac-Islander           Private       329  150700.091185
  11  Asian-Pac-Islander      Self-emp-inc         4  134134.750000
  12  Asian-Pac-Islander  Self-emp-not-inc         9  213206.555556
  13  Asian-Pac-Islander         State-gov        22  137489.045455
  14               Black                 ?       139  234105.791367
  15               Black       Federal-gov       139  199892.784173
  16               Black         Local-gov       184  214944.831522
  17               Black           Private      1336  231948.255240
  18               Black      Self-emp-inc         6  268401.500000
  19               Black  Self-emp-not-inc        26  239464.000000
  20               Black         State-gov       107  233167.289720
  21               Other                 ?         7  236375.285714
  22               Other       Federal-gov         2   30376.000000
  23               Other         Local-gov         6  199176.333333
  24               Other           Private        91  186326.318681
  25               Other      Self-emp-inc         1  119471.000000
  26               Other  Self-emp-not-inc         4  164255.000000
  27               Other         State-gov         7  129428.142857
  28               White                 ?      2337  184600.948652
  29               White       Federal-gov      1069  179681.003742
  30               White         Local-gov      2559  186512.757718
  31               White           Private     29024  190066.002929
  32               White      Self-emp-inc      1585  179184.574132
  33               White  Self-emp-not-inc      3576  173022.421980
  34               White         State-gov      1612  176873.359181,
  'query_syn':                   race         workclass  COUNT(*)    AVG(fnlwgt)
  0   Amer-Indian-Eskimo                 ?        57   90053.385965
  1   Amer-Indian-Eskimo       Federal-gov        62   80418.129032
  2   Amer-Indian-Eskimo         Local-gov        55  104654.945455
  3   Amer-Indian-Eskimo           Private       342  141621.309942
  4   Amer-Indian-Eskimo      Self-emp-inc         0       0.000000
  5   Amer-Indian-Eskimo  Self-emp-not-inc        21  104643.952381
  6   Amer-Indian-Eskimo         State-gov        39  108200.897436
  7   Asian-Pac-Islander                 ?        59  156212.813559
  8   Asian-Pac-Islander       Federal-gov        63  142789.095238
  9   Asian-Pac-Islander         Local-gov        48  171984.395833
  10  Asian-Pac-Islander           Private       842  160887.634204
  11  Asian-Pac-Islander      Self-emp-inc        15  141412.266667
  12  Asian-Pac-Islander  Self-emp-not-inc        45  164975.266667
  13  Asian-Pac-Islander         State-gov        59  145332.898305
  14               Black                 ?       289  214004.948097
  15               Black       Federal-gov       343  214628.160350
  16               Black         Local-gov       514  218064.276265
  17               Black           Private      4166  226841.697552
  18               Black      Self-emp-inc        19  201494.789474
  19               Black  Self-emp-not-inc        85  231969.952941
  20               Black         State-gov       347  231915.731988
  21               Other                 ?        10  222221.400000
  22               Other       Federal-gov        10  211250.200000
  23               Other         Local-gov        17  165354.411765
  24               Other           Private       201  195156.000000
  25               Other      Self-emp-inc         1   79448.000000
  26               Other  Self-emp-not-inc         2  219765.000000
  27               Other         State-gov        11  132606.909091
  28               White                 ?      2424  181479.830033
  29               White       Federal-gov      1370  177392.143796
  30               White         Local-gov      2477  187808.748890
  31               White           Private     27340  186434.649525
  32               White      Self-emp-inc       837  176358.512545
  33               White  Self-emp-not-inc      1994  173903.789368
  34               White         State-gov      1763  177995.702212,
  'query_desc': {'type': 'twin_agg',
   'agg_fntn': ('AVG', 'fnlwgt'),
   'grpby_vars': ['race', 'workclass'],
   'from_tbl_name_real': 'C1',
   'join_tbl_name_lst_real': [],
   'sql_real': "SELECT race, workclass, COUNT(*), AVG(fnlwgt)  FROM C1  WHERE   race IN ('Amer-Indian-Eskimo', 'White') OR  marital_status <> 'Married-civ-spouse' AND  hours_per_week BETWEEN 40 AND 40  GROUP BY race, workclass",
   'n_cols_real': 4,
   'n_rows_real': 35,
   'from_tbl_name_syn': 'C1_syn_default_1',
   'join_tbl_name_lst_syn': [],
   'sql_syn': "SELECT race, workclass, COUNT(*), AVG(fnlwgt)  FROM C1_syn_default_1  WHERE   race IN ('Amer-Indian-Eskimo', 'White') OR  marital_status <> 'Married-civ-spouse' AND  hours_per_week BETWEEN 40 AND 40  GROUP BY race, workclass",
   'n_cols_syn': 4,
   'n_rows_syn': 34},
  'query_hlngr_score': 0.13474501163436428,
  'query_ecldn_score': nan},
 {'query_real':            marital_status    relationship  COUNT(*)  AVG(capital)
  0                Divorced   Not-in-family         4  -1808.500000
  1                Divorced  Other-relative         0      0.000000
  2                Divorced       Own-child         0      0.000000
  3                Divorced       Unmarried         2  -2322.500000
  4      Married-civ-spouse         Husband       114  -2019.614035
  5      Married-civ-spouse   Not-in-family         0      0.000000
  6      Married-civ-spouse  Other-relative         0      0.000000
  7      Married-civ-spouse       Own-child         0      0.000000
  8      Married-civ-spouse       Unmarried         0      0.000000
  9      Married-civ-spouse            Wife         6  -2104.166667
  10  Married-spouse-absent   Not-in-family         0      0.000000
  11  Married-spouse-absent       Unmarried         0      0.000000
  12          Never-married   Not-in-family         4  -1989.000000
  13          Never-married  Other-relative         1  -2444.000000
  14          Never-married       Own-child         2  -2040.500000
  15          Never-married       Unmarried         1   -625.000000
  16              Separated   Not-in-family         0      0.000000
  17              Separated       Own-child         0      0.000000
  18              Separated       Unmarried         1  -2824.000000
  19                Widowed         Husband         0      0.000000
  20                Widowed   Not-in-family         0      0.000000
  21                Widowed       Unmarried         1  -2559.000000,
  'query_syn':            marital_status    relationship  COUNT(*)  AVG(capital)
  0                Divorced   Not-in-family        51    -57.490196
  1                Divorced  Other-relative         2    -92.500000
  2                Divorced       Own-child         2    -73.500000
  3                Divorced       Unmarried        58   -100.327586
  4      Married-civ-spouse         Husband       264    -78.352273
  5      Married-civ-spouse   Not-in-family         2    -58.000000
  6      Married-civ-spouse  Other-relative         1     -4.000000
  7      Married-civ-spouse       Own-child         1   -160.000000
  8      Married-civ-spouse       Unmarried         2   -181.000000
  9      Married-civ-spouse            Wife        14    -83.428571
  10  Married-spouse-absent   Not-in-family         3    -28.000000
  11  Married-spouse-absent       Unmarried         2    -69.000000
  12          Never-married   Not-in-family        37    -77.837838
  13          Never-married  Other-relative         0      0.000000
  14          Never-married       Own-child        24    -79.541667
  15          Never-married       Unmarried         7    -96.857143
  16              Separated   Not-in-family         3    -48.666667
  17              Separated       Own-child         2   -100.000000
  18              Separated       Unmarried        10   -131.200000
  19                Widowed         Husband         1   -124.000000
  20                Widowed   Not-in-family         2    -52.500000
  21                Widowed       Unmarried         3   -116.333333,
  'query_desc': {'type': 'twin_agg',
   'agg_fntn': ('AVG', 'capital'),
   'grpby_vars': ['marital_status', 'relationship'],
   'from_tbl_name_real': 'C1',
   'join_tbl_name_lst_real': [],
   'sql_real': "SELECT marital_status, relationship, COUNT(*), AVG(capital)  FROM C1  WHERE   occupation NOT IN ('Transport-moving', 'Other-service') AND  capital < 0 AND  workclass LIKE 'Self-emp-inc'  GROUP BY marital_status, relationship",
   'n_cols_real': 4,
   'n_rows_real': 10,
   'from_tbl_name_syn': 'C1_syn_default_1',
   'join_tbl_name_lst_syn': [],
   'sql_syn': "SELECT marital_status, relationship, COUNT(*), AVG(capital)  FROM C1_syn_default_1  WHERE   occupation NOT IN ('Transport-moving', 'Other-service') AND  capital < 0 AND  workclass LIKE 'Self-emp-inc'  GROUP BY marital_status, relationship",
   'n_cols_syn': 4,
   'n_rows_syn': 21},
  'query_hlngr_score': 0.30523941210348926,
  'query_ecldn_score': nan},
 {'query_real':   relationship     sex  COUNT(*)  SUM(hours_per_week)
  0      Husband    Male       500                17038
  1    Own-child  Female         1                   40
  2         Wife  Female        41                 1086,
  'query_syn':   relationship     sex COUNT(*) SUM(hours_per_week)
  0      Husband    Male        0                   0
  1    Own-child  Female        0                   0
  2         Wife  Female        0                   0,
  'query_desc': {'type': 'twin_agg',
   'agg_fntn': ('SUM', 'hours_per_week'),
   'grpby_vars': ['relationship', 'sex'],
   'from_tbl_name_real': 'C1',
   'join_tbl_name_lst_real': [],
   'sql_real': "SELECT relationship, sex, COUNT(*), SUM(hours_per_week)  FROM C1  WHERE   age BETWEEN 62 AND 77 AND  education = 'HS-grad' AND NOT  marital_status <> 'Married-civ-spouse'  GROUP BY relationship, sex",
   'n_cols_real': 4,
   'n_rows_real': 3,
   'from_tbl_name_syn': 'C1_syn_default_1',
   'join_tbl_name_lst_syn': [],
   'sql_syn': "SELECT relationship, sex, COUNT(*), SUM(hours_per_week)  FROM C1_syn_default_1  WHERE   age BETWEEN 62 AND 77 AND  education = 'HS-grad' AND NOT  marital_status <> 'Married-civ-spouse'  GROUP BY relationship, sex",
   'n_cols_syn': 4,
   'n_rows_syn': 0},
  'query_hlngr_score': 0.0,
  'query_ecldn_score': nan},
 {'query_real':           occupation                race  COUNT(*)  SUM(age)
  0                  ?  Amer-Indian-Eskimo         1        18
  1                  ?  Asian-Pac-Islander         2        44
  2                  ?               Black         5       147
  3                  ?               Other         1        20
  4                  ?               White        53      2091
  ..               ...                 ...       ...       ...
  63  Transport-moving  Amer-Indian-Eskimo         1        35
  64  Transport-moving  Asian-Pac-Islander         0         0
  65  Transport-moving               Black         5       175
  66  Transport-moving               Other         0         0
  67  Transport-moving               White        54      2222

  [68 rows x 4 columns],
  'query_syn':           occupation                race  COUNT(*)  SUM(age)
  0                  ?  Amer-Indian-Eskimo        12       447
  1                  ?  Asian-Pac-Islander        34       878
  2                  ?               Black       142      4432
  3                  ?               Other         7       196
  4                  ?               White       910     25666
  ..               ...                 ...       ...       ...
  63  Transport-moving  Amer-Indian-Eskimo         7       276
  64  Transport-moving  Asian-Pac-Islander        10       326
  65  Transport-moving               Black        80      2984
  66  Transport-moving               Other         3       108
  67  Transport-moving               White       321     12134

  [68 rows x 4 columns],
  'query_desc': {'type': 'twin_agg',
   'agg_fntn': ('SUM', 'age'),
   'grpby_vars': ['occupation', 'race'],
   'from_tbl_name_real': 'C1',
   'join_tbl_name_lst_real': [],
   'sql_real': "SELECT occupation, race, COUNT(*), SUM(age)  FROM C1  WHERE   capital NOT BETWEEN 0 AND 0 AND  hours_per_week <> 72 AND  education LIKE 'Some-college'  GROUP BY occupation, race",
   'n_cols_real': 4,
   'n_rows_real': 49,
   'from_tbl_name_syn': 'C1_syn_default_1',
   'join_tbl_name_lst_syn': [],
   'sql_syn': "SELECT occupation, race, COUNT(*), SUM(age)  FROM C1_syn_default_1  WHERE   capital NOT BETWEEN 0 AND 0 AND  hours_per_week <> 72 AND  education LIKE 'Some-college'  GROUP BY occupation, race",
   'n_cols_syn': 4,
   'n_rows_syn': 68},
  'query_hlngr_score': 0.1886842974810885,
  'query_ecldn_score': nan},
 {'query_real':                   race     education  COUNT(*)  AVG(capital)
  0   Amer-Indian-Eskimo          10th         2      0.000000
  1   Amer-Indian-Eskimo          11th         3      0.000000
  2   Amer-Indian-Eskimo       1st-4th         2      0.000000
  3   Amer-Indian-Eskimo       7th-8th         3   1302.666667
  4   Amer-Indian-Eskimo           9th         1      0.000000
  ..                 ...           ...       ...           ...
  62               White       HS-grad      1445    863.669896
  63               White       Masters      1523   2609.100460
  64               White     Preschool         3      0.000000
  65               White   Prof-school       540  12351.072222
  66               White  Some-college      1643    860.311625

  [67 rows x 4 columns],
  'query_syn':                   race     education  COUNT(*)  AVG(capital)
  0   Amer-Indian-Eskimo          10th         3    -57.666667
  1   Amer-Indian-Eskimo          11th         1    -96.000000
  2   Amer-Indian-Eskimo       1st-4th         0      0.000000
  3   Amer-Indian-Eskimo       7th-8th         4      7.000000
  4   Amer-Indian-Eskimo           9th         0      0.000000
  ..                 ...           ...       ...           ...
  62               White       HS-grad      1556    -31.025064
  63               White       Masters      1384    -14.116329
  64               White     Preschool         0      0.000000
  65               White   Prof-school       252     -5.583333
  66               White  Some-college      1816    -29.099119

  [67 rows x 4 columns],
  'query_desc': {'type': 'twin_agg',
   'agg_fntn': ('AVG', 'capital'),
   'grpby_vars': ['race', 'education'],
   'from_tbl_name_real': 'C1',
   'join_tbl_name_lst_real': [],
   'sql_real': "SELECT race, education, COUNT(*), AVG(capital)  FROM C1  WHERE   hours_per_week >= 40 AND  occupation IN ('?', 'Exec-managerial', 'Prof-specialty') AND NOT  native_country <> 'United-States'  GROUP BY race, education",
   'n_cols_real': 4,
   'n_rows_real': 64,
   'from_tbl_name_syn': 'C1_syn_default_1',
   'join_tbl_name_lst_syn': [],
   'sql_syn': "SELECT race, education, COUNT(*), AVG(capital)  FROM C1_syn_default_1  WHERE   hours_per_week >= 40 AND  occupation IN ('?', 'Exec-managerial', 'Prof-specialty') AND NOT  native_country <> 'United-States'  GROUP BY race, education",
   'n_cols_syn': 4,
   'n_rows_syn': 60},
  'query_hlngr_score': 0.12027703458106821,
  'query_ecldn_score': nan},
 {'query_real':         education   native_country  COUNT(*)  AVG(hours_per_week)
  0            10th                ?         3            38.666667
  1            10th           Canada         0             0.000000
  2            10th         Columbia         2            40.000000
  3            10th             Cuba         3            31.666667
  4            10th      El-Salvador         0             0.000000
  ..            ...              ...       ...                  ...
  386  Some-college           Taiwan         0             0.000000
  387  Some-college         Thailand         0             0.000000
  388  Some-college  Trinadad&Tobago         2            37.500000
  389  Some-college    United-States      2172            42.111878
  390  Some-college          Vietnam         2            40.000000

  [391 rows x 4 columns],
  'query_syn':         education   native_country  COUNT(*)  AVG(hours_per_week)
  0            10th                ?         4            40.000000
  1            10th           Canada         1            40.000000
  2            10th         Columbia         0             0.000000
  3            10th             Cuba         1            40.000000
  4            10th      El-Salvador         2            39.000000
  ..            ...              ...       ...                  ...
  386  Some-college           Taiwan         1            40.000000
  387  Some-college         Thailand         9            40.000000
  388  Some-college  Trinadad&Tobago         2            39.500000
  389  Some-college    United-States      2308            39.917244
  390  Some-college          Vietnam         1            40.000000

  [391 rows x 4 columns],
  'query_desc': {'type': 'twin_agg',
   'agg_fntn': ('AVG', 'hours_per_week'),
   'grpby_vars': ['education', 'native_country'],
   'from_tbl_name_real': 'C1',
   'join_tbl_name_lst_real': [],
   'sql_real': "SELECT education, native_country, COUNT(*), AVG(hours_per_week)  FROM C1  WHERE   fnlwgt BETWEEN 162302 AND 255386 AND NOT  marital_status = 'Never-married' AND NOT  sex NOT IN ('Male', 'Female')  GROUP BY education, native_country",
   'n_cols_real': 4,
   'n_rows_real': 320,
   'from_tbl_name_syn': 'C1_syn_default_1',
   'join_tbl_name_lst_syn': [],
   'sql_syn': "SELECT education, native_country, COUNT(*), AVG(hours_per_week)  FROM C1_syn_default_1  WHERE   fnlwgt BETWEEN 162302 AND 255386 AND NOT  marital_status = 'Never-married' AND NOT  sex NOT IN ('Male', 'Female')  GROUP BY education, native_country",
   'n_cols_syn': 4,
   'n_rows_syn': 303},
  'query_hlngr_score': 0.1581637835168341,
  'query_ecldn_score': 0.0},
 {'query_real':    relationship     education  COUNT(*)    AVG(fnlwgt)
  0       Husband          10th       471  198181.915074